### Terraform CICD Plan Part # 1
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  <pre>
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_secretsmanager_secret.example will be created
  + resource "aws_secretsmanager_secret" "example" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "example"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

  </pre>
  </details>
  *Pusher: @jessicamalloy, Action: `pull_request`, Workflow: `plan terraform`*